# ReferencePoint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..ReferencePoint Property
BaseImportOptions Class See Also
---
The 3D point in the document where the imported instance will be inserted. If not explicitly set, the instance will be inserted at the document origin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ ReferencePoint { get; set; }
```

Visual Basic
---
```text
Public Property ReferencePoint As XYZ
	Get
	Set
```

Visual C++
---
```text
public:
property XYZ^ ReferencePoint {
	XYZ^ get ();
	void set (XYZ^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace